httpstorm/sdk-nrf/samples/nrf9160/gnss_thingy/src/main.c
#if CONFIG_UART_BLE
#if USE_UART_MINIPORT
	uarts[UART_BLE]->send(uarts[UART_BLE], nmea_string, length);
#else
	int uart_ble_send(const char * msg, uint16_t length);
	uart_ble_send(nmea_string, length);
#endif
#endif

#if CONFIG_NETWORKING_ENABLE
	if ((nmea_p + length) > nmea_p)
	{
		send_nmea_data();
	}

	if ((nmea_p + length) <= nmea_p)
	{
		memcpy(nmea_p, nmea_string, length);
		nmea_p += length;
	}
#endif
}

int main(void)
{
	int err;
	uint8_t cnt = 0;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	LOG_INF("Starting GNSS sample");

	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}

	const struct gpio_dt_spec led0 = LED0;
	gpio_pin_configure_dt(&led0, GPIO_OUTPUT_ACTIVE | FLAGS);

#if CONFIG_UART_BLE
#if USE_UART_MINIPORT
	uarts[UART_BLE] = uart_open(UART_BLE);

	if (!uarts[UART_BLE])
	{
		LOG_ERR("UART[%u]->uart_open  FAILED", (uint32_t)UART_BLE);
	}

	if (!uarts[UART_BLE]->config.enabled)
	{
		uarts[UART_BLE] = NULL;
		LOG_INF("UART[%u] disabled", (uint32_t)UART_BLE);
	}

	LOG_INF("UART[%u] miniport: starting...", (uint32_t)UART_BLE);
	uarts[UART_BLE]->config.int_priority = 0x4;

	if (UART_STATUS_OK != uarts[UART_BLE]->init(uarts[UART_BLE]))
	{
		uarts[UART_BLE] = NULL;
		LOG_ERR("UART[%u]->init  FAILED", (uint32_t)UART_BLE);
	}

	LOG_INF("UART[%u] ready %u", (uint32_t)UART_BLE, uarts[UART_BLE]->baud_rate);
#endif
#endif

#if CONFIG_NETWORKING_ENABLE
	// init button and LED
	led_init();
	btn_init();
	lte_init();
#endif

	LOG_INF("Starting GNSS sample");

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		return -1;
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	fix_timestamp = k_uptime_get();

	for (;;) {
		(void)k_poll(events, 2, K_FOREVER);

		if (events[0].state == K_POLL_STATE_SEM_AVAILABLE &&
		    k_sem_take(events[0].sem, K_NO_WAIT) == 0) {
			/* New PVT data available */

			if (IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)) {
				/* TTFF test mode. */

				/* Calculate the time GNSS has been blocked by LTE. */
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					time_blocked++;
				}
			} else if (IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY)) {
				/* NMEA-only output mode. */

				if (output_paused()) {
					goto handle_nmea;
				}

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					print_distance_from_reference(&last_pvt);
				}
			} else {
				/* PVT and NMEA output mode. */

				if (output_paused()) {
					goto handle_nmea;
				}

				printf("\033[1;1H");
				printf("\033[2J");
				print_satellite_stats(&last_pvt);

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					printf("GNSS operation blocked by LTE\n");
				}
				if (last_pvt.flags &
				    NRF_MODEM_GNSS_PVT_FLAG_NOT_ENOUGH_WINDOW_TIME) {
					printf("Insufficient GNSS time windows\n");
				}
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_SLEEP_BETWEEN_PVT) {
					printf("Sleep period(s) between PVT notifications\n");
				}
				printf("-----------------------------------\n");

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					fix_timestamp = k_uptime_get();
					print_fix_data(&last_pvt);
					print_distance_from_reference(&last_pvt);
				} else {
					printf("Seconds since last fix: %d\n",
					       (uint32_t)((k_uptime_get() - fix_timestamp) / 1000));
					cnt++;
					printf("Searching [%c]\n", update_indicator[cnt%4]);
				}

				gpio_pin_set_dt(&led0, (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) ? 1 : 0);

#if CONFIG_NETWORKING_ENABLE
				send_nmea_data();
#endif

				printf("\nNMEA strings:\n\n");
			}
		}

handle_nmea:
		if (events[1].state == K_POLL_STATE_MSGQ_DATA_AVAILABLE &&
		    k_msgq_get(events[1].msgq, &nmea_data, K_NO_WAIT) == 0) {
			/* New NMEA data available */

			if (!output_paused()) {
				printf("%s", nmea_data->nmea_str);
				print_nmea_data(nmea_data->nmea_str);
			}
			k_free(nmea_data);
		}

		events[0].state = K_POLL_STATE_NOT_READY;
		events[1].state = K_POLL_STATE_NOT_READY;
	}

	return 0;
}
